public_html/Python/Python Sites.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Python Sites </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Python Sites "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-01T22:40+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Python Sites </h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Tutorial</a></li>
<li><a href="#sec-2">Lib</a>
<ul>
<li><a href="#sec-2-1">matplotlib</a></li>
<li><a href="#sec-2-2">NumPy</a></li>
<li><a href="#sec-2-3">Natural Language Toolkit</a></li>
<li><a href="#sec-2-4">Open source Python modules</a></li>
<li><a href="#sec-2-5">Sage</a></li>
</ul>
</li>
<li><a href="#sec-3">OpenSource Project</a>
<ul>
<li><a href="#sec-3-1">Django</a></li>
<li><a href="#sec-3-2">py2exe</a></li>
<li><a href="#sec-3-3">Twisted</a></li>
<li><a href="#sec-3-4">Mercurial</a></li>
<li><a href="#sec-3-5">Pygame</a></li>
<li><a href="#sec-3-6">ipython</a></li>
<li><a href="#sec-3-7">Cobbler</a></li>
<li><a href="#sec-3-8">thousandparsec</a></li>
<li><a href="#sec-3-9">GEOS - Geometry Engine, Open Source</a></li>
<li><a href="#sec-3-10">Bazaar</a></li>
<li><a href="#sec-3-11">Trac</a></li>
<li><a href="#sec-3-12">gPodder</a></li>
<li><a href="#sec-3-13">Tendenci</a></li>
<li><a href="#sec-3-14">Zope</a></li>
<li><a href="#sec-3-15">TO</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Tutorial</h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Lib</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">matplotlib</h3>
<div class="outline-text-3" id="text-2-1">

<p><a href="http://matplotlib.sourceforge.net/">http://matplotlib.sourceforge.net/</a>
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">NumPy</h3>
<div class="outline-text-3" id="text-2-2">

<p>Python 用于科学计算的最重要函数库应该是 NumPy
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Natural Language Toolkit</h3>
<div class="outline-text-3" id="text-2-3">

<p><a href="http://nltk.org/">http://nltk.org/</a>
</p></div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Open source Python modules</h3>
<div class="outline-text-3" id="text-2-4">

<p><a href="http://www.nltk.org/">http://www.nltk.org/</a>
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Sage</h3>
<div class="outline-text-3" id="text-2-5">

<p><a href="http://www.sagemath.org/">http://www.sagemath.org/</a>
</p>
<p>
Sage is a free open-source mathematics software system licensed under
the GPL. It combines the power of many existing open-source packages
into a common Python-based interface.
</p>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">OpenSource Project</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Django</h3>
<div class="outline-text-3" id="text-3-1">

<p><a href="https://www.djangoproject.com/download/">https://www.djangoproject.com/download/</a>
</p>
<p>
Django is a high-level Python Web framework that encourages rapid
development and clean, pragmatic design.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">py2exe</h3>
<div class="outline-text-3" id="text-3-2">

<p><a href="http://www.py2exe.org/">http://www.py2exe.org/</a>
</p>
<p>
py2exe is a Python Distutils extension which converts Python scripts
into executable Windows programs, able to run without requiring a
Python installation.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Twisted</h3>
<div class="outline-text-3" id="text-3-3">

<p><a href="http://twistedmatrix.com/trac/">http://twistedmatrix.com/trac/</a>
</p>
<p>
Twisted is an event-driven networking engine written in Python and
licensed under the open source
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Mercurial</h3>
<div class="outline-text-3" id="text-3-4">

<p><a href="http://mercurial.selenic.com/">http://mercurial.selenic.com/</a>
</p>
<p>
Mercurial is a free, distributed source control management tool. It
efficiently handles projects of any size and offers an easy and
intuitive interface.
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Pygame</h3>
<div class="outline-text-3" id="text-3-5">

<p><a href="http://www.pygame.org/wiki/about">http://www.pygame.org/wiki/about</a>
</p>
<p>
Pygame is a set of Python modules designed for writing games. Pygame
adds functionality on top of the excellent SDL library. This allows
you to create fully featured games and multimedia programs in the
python language. Pygame is highly portable and runs on nearly every
platform and operating system. Pygame itself has been downloaded
millions of times, and has had millions of visits to its website.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">ipython</h3>
<div class="outline-text-3" id="text-3-6">

<p><a href="http://ipython.org/">http://ipython.org/</a>
</p>
<p>
IPython provides a rich toolkit to help you make the most out of using Python, with:
</p>
<ul>
<li>Powerful Python shells (terminal and Qt-based).
</li>
<li>A web-based notebook with the same core features but support for code, text, mathematical expressions, inline plots and other rich media.
</li>
<li>Support for interactive data visualization and use of GUI toolkits.
</li>
<li>Flexible, embeddable interpreters to load into your own projects.
</li>
<li>Easy to use, high performance tools for parallel computing.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Cobbler</h3>
<div class="outline-text-3" id="text-3-7">

<p><a href="http://cobbler.github.com">http://cobbler.github.com</a>
</p>
<p>
Cobbler is a Linux installation server that allows for rapid setup of
network installation environments. It glues together and automates
many associated Linux tasks so you do not have to hop between lots of
various commands and applications when rolling out new systems, and,
in some cases, changing existing ones. It can help with installation,
DNS, DHCP, package updates, power management, configuration management
orchestration, and much more.
</p>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">thousandparsec</h3>
<div class="outline-text-3" id="text-3-8">

<p><a href="http://thousandparsec.net/tp/download-instructions.php?product=tpclient-pywx&amp;platform=win32">http://thousandparsec.net/tp/download-instructions.php?product=tpclient-pywx&amp;platform=win32</a>
</p>
<p>
Thousand Parsec is a bunch of games based on a common framework for
building turn based space empire building games. Some of the games,
such as our first demo game MiniSec, are developed by the Thousand
Parsec developers themselves. In the near future we hope that other
developers will create their own games using Thousand Parsec
framework.
</p>
</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">GEOS - Geometry Engine, Open Source</h3>
<div class="outline-text-3" id="text-3-9">

<p><a href="http://trac.osgeo.org/geos/">http://trac.osgeo.org/geos/</a>
</p>
<p>
GEOS (Geometry Engine - Open Source) is a C++ port of the  Java
Topology Suite (JTS). As such, it aims to contain the complete
functionality of JTS in C++. This includes all the  OpenGIS Simple
Features for SQL spatial predicate functions and spatial operators, as
well as specific JTS enhanced topology functions.
</p>
</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">Bazaar</h3>
<div class="outline-text-3" id="text-3-10">

<p><a href="http://wiki.bazaar.canonical.com/SourceDownloads">http://wiki.bazaar.canonical.com/SourceDownloads</a>
</p>
<p>
Bazaar is a distributed version control system that enables easy
collaborative development. One of Bazaar's strengths is its
adaptibility to different work flows.
</p>
</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11">Trac</h3>
<div class="outline-text-3" id="text-3-11">

<p>   developing Trac(<a href="http://trac.edgewall.org/">http://trac.edgewall.org/</a>) and its
plugins(<a href="http://trac-hacks.org/">http://trac-hacks.org/</a>). Look at the more complex ones like
the discussion plugin(<a href="http://trac-hacks.org/wiki/DiscussionPlugin">http://trac-hacks.org/wiki/DiscussionPlugin</a>).
Then look up the Trac
APIs(<a href="http://www.edgewall.org/docs/branches-0.12-stable/epydoc/trac-module.html">http://www.edgewall.org/docs/branches-0.12-stable/epydoc/trac-module.html</a>)
it uses and understand the component model(<a href="http://trac.edgewall.org/wiki/TracDev/ComponentArchitecture">http://trac.edgewall.org/wiki/TracDev/ComponentArchitecture</a>).
</p>

<p>
Why Trac?
</p>
<p>
I think Trac is one of these projects which show how to use Python's
beautiful features in the most sensible way. It's relatively easy to
get started and you will get the important abstractions and concepts
very fast. Plus, Trac is a really cool development tool and I'm sure
sooner or later you'll use it for another project of yours.
</p>
</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12">gPodder</h3>
<div class="outline-text-3" id="text-3-12">

<p><a href="http://gpodder.org/">http://gpodder.org/</a>
</p>
<p>
gPodder downloads and manages free audio and video content
("podcasts") for you. Listen directly on your computer or on your
mobile devices.
</p></div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13">Tendenci</h3>
<div class="outline-text-3" id="text-3-13">

<p>Tendenci is the first open source CMS specifically created for
nonprofit organizations and provides tools like online payments with
merchant account integration, event registration, memberships etc.
with the goal of giving nonprofit organizations better websites
affordably.
</p>
<p>
You can download Tendenci on Github:
<a href="https://github.com/tendenci/tendenci">https://github.com/tendenci/tendenci</a> and contact us/find out more at
<a href="http://tendenci.org">http://tendenci.org</a>.
</p>
</div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14">Zope</h3>
<div class="outline-text-3" id="text-3-14">

<p><a href="http://www.zope.org/the-world-of-zope">http://www.zope.org/the-world-of-zope</a>
</p>
<p>
<a href="http://svn.zope.org/">http://svn.zope.org/</a>
</p>
<p>
Zope is a community project concerned with free and open-source,
object-oriented web application server written in the Python
programming language. Zope stands for "Z Object Publishing
Environment", and was the first system using the now common object
publishing methodology for the Web.
</p>


</div>

</div>

<div id="outline-container-3-15" class="outline-3">
<h3 id="sec-3-15">TO</h3>
<div class="outline-text-3" id="text-3-15">

<p><a href="http://stackoverflow.com/questions/3907561/well-documented-open-source-python-projects-for-a-beginner">http://stackoverflow.com/questions/3907561/well-documented-open-source-python-projects-for-a-beginner</a>
</p>
<p>
<a href="http://pythonsource.com/">http://pythonsource.com/</a>
</p>
<p>
<a href="http://ubuntuforums.org/showthread.php?t=1563165">http://ubuntuforums.org/showthread.php?t=1563165</a>
</p>
<p>
<a href="http://code.google.com/p/pyscripter/">http://code.google.com/p/pyscripter/</a>
</p>
<p>
<a href="http://www.makeuseof.com/tag/the-10-best-open-source-projects-you-should-be-volunteering-to-help-with/">http://www.makeuseof.com/tag/the-10-best-open-source-projects-you-should-be-volunteering-to-help-with/</a>
</p>


<p>
python test
<a href="http://pycheesecake.org/wiki/PythonTestingToolsTaxonomy#FuzzTestingTools">http://pycheesecake.org/wiki/PythonTestingToolsTaxonomy#FuzzTestingTools</a>
</p>
<p>
<a href="http://www.ibm.com/developerworks/aix/library/au-python_test/">http://www.ibm.com/developerworks/aix/library/au-python_test/</a>
</p>
<p>
<a href="http://www.ibm.com/developerworks/views/aix/libraryview.jsp?search_by=python+testing">http://www.ibm.com/developerworks/views/aix/libraryview.jsp?search_by=python+testing</a>
</p>
<p>
The Python Testing Tools Taxonomy
<a href="http://packages.python.org/testing/">http://packages.python.org/testing/</a>
</p>

<p>
<a href="http://code.google.com/p/robotframework/downloads/list">http://code.google.com/p/robotframework/downloads/list</a>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-09-01T22:40+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
